Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрУслуг</xr:Item>
				<xr:Item>AccumulationRegister.РегистрМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.РегистрЗаработнойПлаты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьМинут</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОказаниеУслуг/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПакетноеЗакрытие(Команда)

	МассивСсылок = ПолучитьМассивВыделенныхДокументов();

	Если МассивСсылок.Количество() = 0 Тогда
		Сообщить("Не выбраны документы для пакетного закрытия.");
		Возврат;
	КонецЕсли;

	Результат = ПакетноеЗакрытиеНаСервере(МассивСсылок);
	Сообщить(Результат);

	ОбновитьСписок();

КонецПроцедуры


&НаКлиенте
Процедура ПакетноПровестиЗакрытые(Команда)

	МассивСсылок = ПолучитьМассивВыделенныхДокументов();

	Если МассивСсылок.Количество() = 0 Тогда
		Сообщить("Не выбраны документы для пакетного проведения.");
		Возврат;
	КонецЕсли;

	Результат = ПакетноПровестиЗакрытыеНаСервере(МассивСсылок);
	Сообщить(Результат);

	ОбновитьСписок();

КонецПроцедуры


&НаКлиенте
Функция ПолучитьМассивВыделенныхДокументов()

	Результат = Новый Массив;

	ЭлементСписка = Элементы.Найти("Список");

	Если ЭлементСписка = Неопределено Тогда
		Сообщить("Не найден элемент формы 'Список'. Проверь имя элемента списка на форме.");
		Возврат Результат;
	КонецЕсли;

	Попытка

		ВыделенныеСтроки = ЭлементСписка.ВыделенныеСтроки;

		Если ВыделенныеСтроки <> Неопределено Тогда

			Для Каждого ЭлементВыделения Из ВыделенныеСтроки Цикл
				ДобавитьСсылкуДокументаВМассив(Результат, ЭлементВыделения);
			КонецЦикла;

		КонецЕсли;

	Исключение
	КонецПопытки;

	Если Результат.Количество() = 0 Тогда

		Попытка
			ТекущаяСтрока = ЭлементСписка.ТекущаяСтрока;
			ДобавитьСсылкуДокументаВМассив(Результат, ТекущаяСтрока);
		Исключение
			Сообщить("Не удалось получить текущую строку списка.");
		КонецПопытки;

	КонецЕсли;

	Возврат Результат;

КонецФункции


&НаКлиенте
Процедура ДобавитьСсылкуДокументаВМассив(МассивСсылок, ЗначениеСтроки)

	Если ЗначениеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ЗначениеСтроки) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда

		Если ЗначениеЗаполнено(ЗначениеСтроки) Тогда
			МассивСсылок.Добавить(ЗначениеСтроки);
		КонецЕсли;

		Возврат;

	КонецЕсли;

	Попытка

		Если ЗначениеЗаполнено(ЗначениеСтроки.Ссылка) Тогда
			МассивСсылок.Добавить(ЗначениеСтроки.Ссылка);
		КонецЕсли;

	Исключение
	КонецПопытки;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписок()

	ЭлементСписка = Элементы.Найти("Список");

	Если ЭлементСписка <> Неопределено Тогда

		Попытка
			ЭлементСписка.Обновить();
		Исключение
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ПакетноеЗакрытиеНаСервере(МассивСсылок) Экспорт

	КоличествоИзменено = 0;
	КоличествоУжеЗакрыто = 0;
	КоличествоИсправлено = 0;
	КоличествоПропущено = 0;
	КоличествоОшибок = 0;

	ТекстПропусков = "";
	ТекстОшибок = "";

	Для Каждого СсылкаДок Из МассивСсылок Цикл

		Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
			КоличествоПропущено = КоличествоПропущено + 1;
			ТекстПропусков = ДобавитьСтрокуСообщения(ТекстПропусков, "Пустая ссылка на документ.");
			Продолжить;
		КонецЕсли;

		Попытка

			Если ТипЗнч(СсылкаДок) <> Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				КоличествоПропущено = КоличествоПропущено + 1;
				ТекстПропусков = ДобавитьСтрокуСообщения(
					ТекстПропусков,
					"Пропущен не тот тип документа: " + Строка(СсылкаДок));
				Продолжить;
			КонецЕсли;

			ДокОбъект = СсылкаДок.ПолучитьОбъект();

			Если ДокОбъект.СтатусУслуги = Перечисления.СтатусУслуги.Завершен Тогда
				КоличествоУжеЗакрыто = КоличествоУжеЗакрыто + 1;
				Продолжить;
			КонецЕсли;

			// Исправляем неправильное состояние:
			// документ проведен, но статус еще Запланирован.
			Если ДокОбъект.Проведен
				И ДокОбъект.СтатусУслуги = Перечисления.СтатусУслуги.Запланирован Тогда

				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокОбъект.СтатусУслуги = Перечисления.СтатусУслуги.Завершен;
				ДокОбъект.Записать();

				КоличествоИсправлено = КоличествоИсправлено + 1;
				Продолжить;

			КонецЕсли;

			Если ДокОбъект.Проведен Тогда
				КоличествоПропущено = КоличествоПропущено + 1;
				ТекстПропусков = ДобавитьСтрокуСообщения(
					ТекстПропусков,
					"Документ уже проведен: " + Строка(СсылкаДок));
				Продолжить;
			КонецЕсли;

			Если ДокОбъект.СтатусУслуги <> Перечисления.СтатусУслуги.Запланирован Тогда
				КоличествоПропущено = КоличествоПропущено + 1;
				ТекстПропусков = ДобавитьСтрокуСообщения(
					ТекстПропусков,
					"Документ пропущен. Текущий статус: "
					+ Строка(ДокОбъект.СтатусУслуги)
					+ ". Для закрытия нужен статус: Запланирован. Документ: "
					+ Строка(СсылкаДок));
				Продолжить;
			КонецЕсли;

			ДокОбъект.СтатусУслуги = Перечисления.СтатусУслуги.Завершен;
			ДокОбъект.Записать();

			КоличествоИзменено = КоличествоИзменено + 1;

		Исключение

			КоличествоОшибок = КоличествоОшибок + 1;

			ТекстОшибок = ДобавитьСтрокуСообщения(
				ТекстОшибок,
				"Не удалось закрыть документ: "
				+ Строка(СсылкаДок)
				+ ". Причина: "
				+ ОписаниеОшибки());

		КонецПопытки;

	КонецЦикла;

	Возврат "Пакетное закрытие завершено."
		+ Символы.ПС + "Изменено: " + Строка(КоличествоИзменено)
		+ Символы.ПС + "Исправлено неправильно проведенных: " + Строка(КоличествоИсправлено)
		+ Символы.ПС + "Уже закрыто: " + Строка(КоличествоУжеЗакрыто)
		+ Символы.ПС + "Пропущено: " + Строка(КоличествоПропущено)
		+ Символы.ПС + "Ошибок: " + Строка(КоличествоОшибок)
		+ ?(ПустаяСтрока(ТекстПропусков), "", Символы.ПС + Символы.ПС + "Причины пропуска:" + Символы.ПС + ТекстПропусков)
		+ ?(ПустаяСтрока(ТекстОшибок), "", Символы.ПС + Символы.ПС + "Ошибки:" + Символы.ПС + ТекстОшибок);

КонецФункции


&НаСервере
Функция ПакетноПровестиЗакрытыеНаСервере(МассивСсылок) Экспорт

	КоличествоПроведено = 0;
	КоличествоУжеПроведено = 0;
	КоличествоПропущено = 0;
	КоличествоОшибок = 0;

	ТекстПропусков = "";
	ТекстОшибок = "";

	Для Каждого СсылкаДок Из МассивСсылок Цикл

		Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
			КоличествоПропущено = КоличествоПропущено + 1;
			ТекстПропусков = ДобавитьСтрокуСообщения(ТекстПропусков, "Пустая ссылка на документ.");
			Продолжить;
		КонецЕсли;

		Попытка

			Если ТипЗнч(СсылкаДок) <> Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				КоличествоПропущено = КоличествоПропущено + 1;
				ТекстПропусков = ДобавитьСтрокуСообщения(
					ТекстПропусков,
					"Пропущен не тот тип документа: " + Строка(СсылкаДок));
				Продолжить;
			КонецЕсли;

			ДокОбъект = СсылкаДок.ПолучитьОбъект();

			Если ДокОбъект.Проведен Тогда

				Если ДокОбъект.СтатусУслуги = Перечисления.СтатусУслуги.Завершен Тогда
					КоличествоУжеПроведено = КоличествоУжеПроведено + 1;
				Иначе
					КоличествоПропущено = КоличествоПропущено + 1;
					ТекстПропусков = ДобавитьСтрокуСообщения(
						ТекстПропусков,
						"Документ уже проведен, но статус не Завершен. Сначала нажмите Пакетное закрытие: "
						+ Строка(СсылкаДок));
				КонецЕсли;

				Продолжить;

			КонецЕсли;

			Если ДокОбъект.СтатусУслуги <> Перечисления.СтатусУслуги.Завершен Тогда
				КоличествоПропущено = КоличествоПропущено + 1;
				ТекстПропусков = ДобавитьСтрокуСообщения(
					ТекстПропусков,
					"Документ пропущен. Текущий статус: "
					+ Строка(ДокОбъект.СтатусУслуги)
					+ ". Для проведения нужен статус: Завершен. Документ: "
					+ Строка(СсылкаДок));
				Продолжить;
			КонецЕсли;

			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);

			КоличествоПроведено = КоличествоПроведено + 1;

		Исключение

			КоличествоОшибок = КоличествоОшибок + 1;

			ТекстОшибок = ДобавитьСтрокуСообщения(
				ТекстОшибок,
				"Не удалось провести документ: "
				+ Строка(СсылкаДок)
				+ ". Причина: "
				+ ОписаниеОшибки());

		КонецПопытки;

	КонецЦикла;

	Возврат "Пакетное проведение завершено."
		+ Символы.ПС + "Проведено: " + Строка(КоличествоПроведено)
		+ Символы.ПС + "Уже проведено: " + Строка(КоличествоУжеПроведено)
		+ Символы.ПС + "Пропущено: " + Строка(КоличествоПропущено)
		+ Символы.ПС + "Ошибок: " + Строка(КоличествоОшибок)
		+ ?(ПустаяСтрока(ТекстПропусков), "", Символы.ПС + Символы.ПС + "Причины пропуска:" + Символы.ПС + ТекстПропусков)
		+ ?(ПустаяСтрока(ТекстОшибок), "", Символы.ПС + Символы.ПС + "Ошибки:" + Символы.ПС + ТекстОшибок);

КонецФункции


&НаСервереБезКонтекста
Функция ДобавитьСтрокуСообщения(ТекущийТекст, НоваяСтрока)

	Если ПустаяСтрока(ТекущийТекст) Тогда
		Возврат НоваяСтрока;
	Иначе
		Возврат ТекущийТекст + Символы.ПС + НоваяСтрока;
	КонецЕсли;

КонецФункции
